wosayttn/Gerrit_NuMicro/M2003xI_M2003xJ_Series/Library/Device/Nuvoton/M2003J/Include/gpio_reg.h
} GPIO_T;

typedef struct
{


    /**
     * @var GPIO_INT_T::INT0_INNF
     * Offset: 0x440  INT0 Input Noise Filter Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |NFEN      |Noise Filter Enable Bit
     * |        |          |0 = Noise Filter function Disabled.
     * |        |          |1 = Noise Filter function Enabled.
     * |[6:4]   |NFSEL     |Noise Filter Clock Selection
     * |        |          |000 = Filter clock is HCLK0.
     * |        |          |001 = Filter clock is HCLK0/2.
     * |        |          |010 = Filter clock is HCLK0/4.
     * |        |          |011 = Filter clock is HCLK0/8.
     * |        |          |100 = Filter clock is HCLK0/16.
     * |        |          |101 = Filter clock is HCLK0/32.
     * |        |          |110 = Filter clock is HCLK0/64.
     * |        |          |111 = Filter clock is HCLK0/128.
     * |[10:8]  |NFCNT     |Noise Filter Count
     * |        |          |The register bits control the filter counter to count from 0 to NFCNT.
     * @var GPIO_INT_T::INT0_EDETCTL
     * Offset: 0x444  INT0 Edge Detect Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[1:0]   |EDETCTL   |INT Edge Detect Control Bits
     * |        |          |00 = Not detect.
     * |        |          |01 = INT low to high detection Enable.
     * |        |          |10 = INT high to low detection Enable.
     * |        |          |11 = INT both low to high and high to low detection Enable.
     * @var GPIO_INT_T::INT0_EDINTEN
     * Offset: 0x448  INT0 Edge Detect Interrupt Enable Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |EDIEN     |INT Edge Detect Interrupt Enable Bit
     * |        |          |0 = INT Edge Detect Interrupt Disable.
     * |        |          |1 = INT Edge Detect Interrupt Enable.
     * |        |          |Note:
     * |        |          |Write 1 clear INTx_EDSTS after configuring EINT and then enable INTx_ EDINTEN.
     * @var GPIO_INT_T::INT0_EDSTS
     * Offset: 0x44C  INT0 Edge Detect Interrupt Flag Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |EDIF      |INT Edge Detect Interrupt Flag (Write 1 to Clear)
     * |        |          |0 = No Edge Detection happened.
     * |        |          |1 = Rising Edge or Falling edge has been detected.
     * |        |          |Note 1: This bit is cleared by writing 1 to it.
     * @var GPIO_INT_T::INT1_INNF
     * Offset: 0x460  INT1 Input Noise Filter Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |NFEN      |Noise Filter Enable Bit
     * |        |          |0 = Noise Filter function Disabled.
     * |        |          |1 = Noise Filter function Enabled.
     * |[6:4]   |NFSEL     |Noise Filter Clock Selection
     * |        |          |000 = Filter clock is HCLK0.
     * |        |          |001 = Filter clock is HCLK0/2.
     * |        |          |010 = Filter clock is HCLK0/4.
     * |        |          |011 = Filter clock is HCLK0/8.
     * |        |          |100 = Filter clock is HCLK0/16.
     * |        |          |101 = Filter clock is HCLK0/32.
     * |        |          |110 = Filter clock is HCLK0/64.
     * |        |          |111 = Filter clock is HCLK0/128.
     * |[10:8]  |NFCNT     |Noise Filter Count
     * |        |          |The register bits control the filter counter to count from 0 to NFCNT.
     * @var GPIO_INT_T::INT1_EDETCTL
     * Offset: 0x464  INT1 Edge Detect Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[1:0]   |EDETCTL   |INT Edge Detect Control Bits
     * |        |          |00 = Not detect.
     * |        |          |01 = INT low to high detection Enable.
     * |        |          |10 = INT high to low detection Enable.
     * |        |          |11 = INT both low to high and high to low detection Enable.
     * @var GPIO_INT_T::INT1_EDINTEN
     * Offset: 0x468  INT1 Edge Detect Interrupt Enable Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |EDIEN     |INT Edge Detect Interrupt Enable Bit
     * |        |          |0 = INT Edge Detect Interrupt Disable.
     * |        |          |1 = INT Edge Detect Interrupt Enable.
     * |        |          |Note:
     * |        |          |Write 1 clear INTx_EDSTS after configuring EINT and then enable INTx_ EDINTEN.
     * @var GPIO_INT_T::INT1_EDSTS
     * Offset: 0x46C  INT1 Edge Detect Interrupt Flag Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |EDIF      |INT Edge Detect Interrupt Flag (Write 1 to Clear)
     * |        |          |0 = No Edge Detection happened.
     * |        |          |1 = Rising Edge or Falling edge has been detected.
     * |        |          |Note 1: This bit is cleared by writing 1 to it.
     * @var GPIO_INT_T::INT2_INNF
     * Offset: 0x480  INT2 Input Noise Filter Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |NFEN      |Noise Filter Enable Bit
     * |        |          |0 = Noise Filter function Disabled.
     * |        |          |1 = Noise Filter function Enabled.
     * |[6:4]   |NFSEL     |Noise Filter Clock Selection
     * |        |          |000 = Filter clock is HCLK0.
     * |        |          |001 = Filter clock is HCLK0/2.
     * |        |          |010 = Filter clock is HCLK0/4.
     * |        |          |011 = Filter clock is HCLK0/8.
     * |        |          |100 = Filter clock is HCLK0/16.
     * |        |          |101 = Filter clock is HCLK0/32.
     * |        |          |110 = Filter clock is HCLK0/64.
     * |        |          |111 = Filter clock is HCLK0/128.
     * |[10:8]  |NFCNT     |Noise Filter Count
     * |        |          |The register bits control the filter counter to count from 0 to NFCNT.
     * @var GPIO_INT_T::INT2_EDETCTL
     * Offset: 0x484  INT2 Edge Detect Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[1:0]   |EDETCTL   |INT Edge Detect Control Bits
     * |        |          |00 = Not detect.
     * |        |          |01 = INT low to high detection Enable.
     * |        |          |10 = INT high to low detection Enable.
     * |        |          |11 = INT both low to high and high to low detection Enable.
     * @var GPIO_INT_T::INT2_EDINTEN
     * Offset: 0x488  INT2 Edge Detect Interrupt Enable Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |EDIEN     |INT Edge Detect Interrupt Enable Bit
     * |        |          |0 = INT Edge Detect Interrupt Disable.
     * |        |          |1 = INT Edge Detect Interrupt Enable.
     * |        |          |Note:
     * |        |          |Write 1 clear INTx_EDSTS after configuring EINT and then enable INTx_ EDINTEN.
     * @var GPIO_INT_T::INT2_EDSTS
     * Offset: 0x48C  INT2 Edge Detect Interrupt Flag Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |EDIF      |INT Edge Detect Interrupt Flag (Write 1 to Clear)
     * |        |          |0 = No Edge Detection happened.
     * |        |          |1 = Rising Edge or Falling edge has been detected.
     * |        |          |Note 1: This bit is cleared by writing 1 to it.
     * @var GPIO_INT_T::INT3_INNF
     * Offset: 0x4A0  INT3 Input Noise Filter Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |NFEN      |Noise Filter Enable Bit
     * |        |          |0 = Noise Filter function Disabled.
     * |        |          |1 = Noise Filter function Enabled.
     * |[6:4]   |NFSEL     |Noise Filter Clock Selection
     * |        |          |000 = Filter clock is HCLK0.
     * |        |          |001 = Filter clock is HCLK0/2.
     * |        |          |010 = Filter clock is HCLK0/4.
     * |        |          |011 = Filter clock is HCLK0/8.
     * |        |          |100 = Filter clock is HCLK0/16.
     * |        |          |101 = Filter clock is HCLK0/32.
     * |        |          |110 = Filter clock is HCLK0/64.
     * |        |          |111 = Filter clock is HCLK0/128.
     * |[10:8]  |NFCNT     |Noise Filter Count
     * |        |          |The register bits control the filter counter to count from 0 to NFCNT.
     * @var GPIO_INT_T::INT3_EDETCTL
     * Offset: 0x4A4  INT3 Edge Detect Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[1:0]   |EDETCTL   |INT Edge Detect Control Bits
     * |        |          |00 = Not detect.
     * |        |          |01 = INT low to high detection Enable.
     * |        |          |10 = INT high to low detection Enable.
     * |        |          |11 = INT both low to high and high to low detection Enable.
     * @var GPIO_INT_T::INT3_EDINTEN
     * Offset: 0x4A8  INT3 Edge Detect Interrupt Enable Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |EDIEN     |INT Edge Detect Interrupt Enable Bit
     * |        |          |0 = INT Edge Detect Interrupt Disable.
     * |        |          |1 = INT Edge Detect Interrupt Enable.
     * |        |          |Note:
     * |        |          |Write 1 clear INTx_EDSTS after configuring EINT and then enable INTx_ EDINTEN.
     * @var GPIO_INT_T::INT3_EDSTS
     * Offset: 0x4AC  INT3 Edge Detect Interrupt Flag Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |EDIF      |INT Edge Detect Interrupt Flag (Write 1 to Clear)
     * |        |          |0 = No Edge Detection happened.
     * |        |          |1 = Rising Edge or Falling edge has been detected.
     * |        |          |Note 1: This bit is cleared by writing 1 to it.
     * @var GPIO_INT_T::INT4_INNF
     * Offset: 0x4C0  INT4 Input Noise Filter Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |NFEN      |Noise Filter Enable Bit
     * |        |          |0 = Noise Filter function Disabled.
     * |        |          |1 = Noise Filter function Enabled.
     * |[6:4]   |NFSEL     |Noise Filter Clock Selection
     * |        |          |000 = Filter clock is HCLK0.
     * |        |          |001 = Filter clock is HCLK0/2.
     * |        |          |010 = Filter clock is HCLK0/4.
     * |        |          |011 = Filter clock is HCLK0/8.
     * |        |          |100 = Filter clock is HCLK0/16.
     * |        |          |101 = Filter clock is HCLK0/32.
     * |        |          |110 = Filter clock is HCLK0/64.
     * |        |          |111 = Filter clock is HCLK0/128.
     * |[10:8]  |NFCNT     |Noise Filter Count
     * |        |          |The register bits control the filter counter to count from 0 to NFCNT.
     * @var GPIO_INT_T::INT4_EDETCTL
     * Offset: 0x4C4  INT4 Edge Detect Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[1:0]   |EDETCTL   |INT Edge Detect Control Bits
     * |        |          |00 = Not detect.
     * |        |          |01 = INT low to high detection Enable.
     * |        |          |10 = INT high to low detection Enable.
     * |        |          |11 = INT both low to high and high to low detection Enable.
     * @var GPIO_INT_T::INT4_EDINTEN
     * Offset: 0x4C8  INT4 Edge Detect Interrupt Enable Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |EDIEN     |INT Edge Detect Interrupt Enable Bit
     * |        |          |0 = INT Edge Detect Interrupt Disable.
     * |        |          |1 = INT Edge Detect Interrupt Enable.
     * |        |          |Note:
     * |        |          |Write 1 clear INTx_EDSTS after configuring EINT and then enable INTx_ EDINTEN.
     * @var GPIO_INT_T::INT4_EDSTS
     * Offset: 0x4CC  INT4 Edge Detect Interrupt Flag Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |EDIF      |INT Edge Detect Interrupt Flag (Write 1 to Clear)
     * |        |          |0 = No Edge Detection happened.
     * |        |          |1 = Rising Edge or Falling edge has been detected.
     * |        |          |Note 1: This bit is cleared by writing 1 to it.
     * @var GPIO_INT_T::INT5_INNF
     * Offset: 0x4E0  INT5 Input Noise Filter Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |NFEN      |Noise Filter Enable Bit
     * |        |          |0 = Noise Filter function Disabled.
     * |        |          |1 = Noise Filter function Enabled.
     * |[6:4]   |NFSEL     |Noise Filter Clock Selection
     * |        |          |000 = Filter clock is HCLK0.
     * |        |          |001 = Filter clock is HCLK0/2.
     * |        |          |010 = Filter clock is HCLK0/4.
     * |        |          |011 = Filter clock is HCLK0/8.
     * |        |          |100 = Filter clock is HCLK0/16.
     * |        |          |101 = Filter clock is HCLK0/32.
     * |        |          |110 = Filter clock is HCLK0/64.
     * |        |          |111 = Filter clock is HCLK0/128.
     * |[10:8]  |NFCNT     |Noise Filter Count
     * |        |          |The register bits control the filter counter to count from 0 to NFCNT.
     * @var GPIO_INT_T::INT5_EDETCTL
     * Offset: 0x4E4  INT5 Edge Detect Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[1:0]   |EDETCTL   |INT Edge Detect Control Bits
     * |        |          |00 = Not detect.
     * |        |          |01 = INT low to high detection Enable.
     * |        |          |10 = INT high to low detection Enable.
     * |        |          |11 = INT both low to high and high to low detection Enable.
     * @var GPIO_INT_T::INT5_EDINTEN
     * Offset: 0x4E8  INT5 Edge Detect Interrupt Enable Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |EDIEN     |INT Edge Detect Interrupt Enable Bit
     * |        |          |0 = INT Edge Detect Interrupt Disable.
     * |        |          |1 = INT Edge Detect Interrupt Enable.
     * |        |          |Note:
     * |        |          |Write 1 clear INTx_EDSTS after configuring EINT and then enable INTx_ EDINTEN.
     * @var GPIO_INT_T::INT5_EDSTS
     * Offset: 0x4EC  INT5 Edge Detect Interrupt Flag Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |EDIF      |INT Edge Detect Interrupt Flag (Write 1 to Clear)
     * |        |          |0 = No Edge Detection happened.
     * |        |          |1 = Rising Edge or Falling edge has been detected.
     * |        |          |Note 1: This bit is cleared by writing 1 to it.
     */
    __IO uint32_t INT0_INNF;             /*!< [0x0440] INT0 Input Noise Filter Register                                 */
    __IO uint32_t INT0_EDETCTL;          /*!< [0x0444] INT0 Edge Detect Control Register                                */
    __IO uint32_t INT0_EDINTEN;          /*!< [0x0448] INT0 Edge Detect Interrupt Enable Control Register               */
    __IO uint32_t INT0_EDSTS;            /*!< [0x044c] INT0 Edge Detect Interrupt Flag Register                         */
    __I  uint32_t RESERVE0[4];
    __IO uint32_t INT1_INNF;             /*!< [0x0460] INT1 Input Noise Filter Register                                 */
    __IO uint32_t INT1_EDETCTL;          /*!< [0x0464] INT1 Edge Detect Control Register                                */
    __IO uint32_t INT1_EDINTEN;          /*!< [0x0468] INT1 Edge Detect Interrupt Enable Control Register               */
    __IO uint32_t INT1_EDSTS;            /*!< [0x046c] INT1 Edge Detect Interrupt Flag Register                         */
    __I  uint32_t RESERVE1[4];
    __IO uint32_t INT2_INNF;             /*!< [0x0480] INT2 Input Noise Filter Register                                 */
    __IO uint32_t INT2_EDETCTL;          /*!< [0x0484] INT2 Edge Detect Control Register                                */
    __IO uint32_t INT2_EDINTEN;          /*!< [0x0488] INT2 Edge Detect Interrupt Enable Control Register               */
    __IO uint32_t INT2_EDSTS;            /*!< [0x048c] INT2 Edge Detect Interrupt Flag Register                         */
    __I  uint32_t RESERVE2[4];
    __IO uint32_t INT3_INNF;             /*!< [0x04a0] INT3 Input Noise Filter Register                                 */
    __IO uint32_t INT3_EDETCTL;          /*!< [0x04a4] INT3 Edge Detect Control Register                                */
    __IO uint32_t INT3_EDINTEN;          /*!< [0x04a8] INT3 Edge Detect Interrupt Enable Control Register               */
    __IO uint32_t INT3_EDSTS;            /*!< [0x04ac] INT3 Edge Detect Interrupt Flag Register                         */
    __I  uint32_t RESERVE3[4];
    __IO uint32_t INT4_INNF;             /*!< [0x04c0] INT4 Input Noise Filter Register                                 */
    __IO uint32_t INT4_EDETCTL;          /*!< [0x04c4] INT4 Edge Detect Control Register                                */
    __IO uint32_t INT4_EDINTEN;          /*!< [0x04c8] INT4 Edge Detect Interrupt Enable Control Register               */
    __IO uint32_t INT4_EDSTS;            /*!< [0x04cc] INT4 Edge Detect Interrupt Flag Register                         */
    __I  uint32_t RESERVE4[4];
    __IO uint32_t INT5_INNF;             /*!< [0x04e0] INT5 Input Noise Filter Register                                 */
    __IO uint32_t INT5_EDETCTL;          /*!< [0x04e4] INT5 Edge Detect Control Register                                */
    __IO uint32_t INT5_EDINTEN;          /*!< [0x04e8] INT5 Edge Detect Interrupt Enable Control Register               */
    __IO uint32_t INT5_EDSTS;            /*!< [0x04ec] INT5 Edge Detect Interrupt Flag Register                         */


} GPIO_INT_T;

/**
    @addtogroup GPIO_CONST GPIO Bit Field Definition
    Constant Definitions for GPIO Controller
@{ */

#define GPIO_MODE_MODE0_Pos              (0)                                               /*!< GPIO_T::MODE: MODE0 Position           */
#define GPIO_MODE_MODE0_Msk              (0x3ul << GPIO_MODE_MODE0_Pos)                    /*!< GPIO_T::MODE: MODE0 Mask               */

#define GPIO_MODE_MODE1_Pos              (2)                                               /*!< GPIO_T::MODE: MODE1 Position           */
#define GPIO_MODE_MODE1_Msk              (0x3ul << GPIO_MODE_MODE1_Pos)                    /*!< GPIO_T::MODE: MODE1 Mask               */

#define GPIO_MODE_MODE2_Pos              (4)                                               /*!< GPIO_T::MODE: MODE2 Position           */
#define GPIO_MODE_MODE2_Msk              (0x3ul << GPIO_MODE_MODE2_Pos)                    /*!< GPIO_T::MODE: MODE2 Mask               */

